import { type Product } from '../store/useStore'

export const products: Product[] = [
  {
    id: 1,
    name: 'Мини хлебное ассорти',
    description: 'Хлеб «Молочный» – 16 шт, Хлеб «Деревенский» – 16 шт, Хлеб «Отрубной» – 16 шт, Хлеб «Морковный» – 16 шт. Итого: 64 шт',
    price: 230000,
    image: 'https://images.unsplash.com/photo-1586444248902-2f64eddc13df?w=800&q=80',
    category: 'home',
  },
  {
    id: 2,
    name: 'Набор «Белый»',
    description: 'Батон «Молочный 60г» – 11 шт, Багет «С луком 60г» – 11 шт, Багет «Артизан 60г» – 11 шт, Хлеб «Молочный» – 10 шт, Хлеб «Фигурный» – 10 шт, Чиабатта – 6 шт. Итого: 61 шт',
    price: 230000,
    image: 'https://images.unsplash.com/photo-1509440159596-0249088772ff?w=800&q=80',
    category: 'home',
  },
  {
    id: 3,
    name: 'Сет «Медиум»',
    description: 'Хлеб «Молочный» – 4 шт, Хлеб «Отрубной» – 4 шт, Хлеб «Деревенский» – 4 шт, Хлеб «Морковно-луковый» – 4 шт, Хлеб «Фигурный» – 4 шт, Багет «Зерновой» – 4 шт, Багет «С луком» – 4 шт. Итого: 44 шт',
    price: 185000,
    image: 'https://images.unsplash.com/photo-1517686469429-8bdb88b9f907?w=800&q=80',
    category: 'home',
  },
  {
    id: 4,
    name: 'Набор «Ассорти»',
    description: 'Тостерный хлеб – 1 шт, Хлеб «Бородинский» – 1 шт, Багет «Зерновой чёрный» – 10 шт, Багет «Молочный» – 7 шт, Хлеб «Зерновой» – 7 шт, Хлеб «Деревенский» – 7 шт, Хлеб «Фигурный» – 7 шт и др. Итого: 78 шт',
    price: 255000,
    image: 'https://images.unsplash.com/photo-1549931319-a545dcf3bc7b?w=800&q=80',
    category: 'home',
  },
  {
    id: 5,
    name: 'Набор «Ржаной»',
    description: 'Хлеб «Бородинский» – 4 шт, Хлеб «Деревенский» – 8 шт, Хлеб «Отрубной» – 8 шт, Хлеб «Квадрат чёрный зерновой» – 8 шт, Багет «Чёрный зерновой» – 8 шт, Багет «Отрубной» – 8 шт. Итого: 52 шт',
    price: 230000,
    image: 'https://images.unsplash.com/photo-1534620808146-d33bb39128b2?w=800&q=80',
    category: 'home',
  },
  {
    id: 6,
    name: '🔥 Сет «Мини слоёное ассорти»',
    description: '«Классический круассан на сливочном масле» – 9 шт, «Pain chocolat» – 9 шт. Свежая слоёная выпечка, доставка бесплатно по Ташкенту',
    price: 300000,
    image: 'https://images.unsplash.com/photo-1555507036-ab1f4038808a?w=800&q=80',
    category: 'home',
  },
]
